EkspoNet/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Роли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EkspoNet/Enums/Роли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Роли</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникСклада</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

EkspoNet/Catalogs/Пользователи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Логин КАК Логин,
	|	Пользователи.УникальныйИдентификатор КАК УникальныйИдентификатор
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", Объект.Логин);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	
	Если Результат.Следующий() Тогда
		
		Если Результат.Количество() = 0 Или ТекущийОбъект.УникальныйИдентификатор = Результат.УникальныйИдентификатор Тогда
			
			ПользовательСсылка = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.УникальныйИдентификатор);
			
			Если ПользовательСсылка = Неопределено Тогда
				
				НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
				НовыйПользователь.Имя = Объект.Логин;
				НовыйПользователь.Пароль = Объект.Пароль;
				НовыйПользователь.ПолноеИмя = Объект.Наименование;
				
				Если Объект.Роль = Перечисления.Роли.Администратор Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администратор);
				Иначе
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.СотрудникСклада);
				КонецЕсли;
				
				НовыйПользователь.ПоказыватьВСпискеВыбора = Истина;
				НовыйПользователь.Записать();
				
				ТекущийОбъект.УникальныйИдентификатор = НовыйПользователь.УникальныйИдентификатор;
				
			Иначе
				
				ПользовательСсылка.Пароль = Объект.Пароль;
				ПользовательСсылка.ПолноеИмя = Объект.Наименование;
				ПользовательСсылка.Роли.Очистить();
				
				Если Объект.Роль = Перечисления.Роли.Администратор Тогда
					ПользовательСсылка.Роли.Добавить(Метаданные.Роли.Администратор);
				Иначе
					ПользовательСсылка.Роли.Добавить(Метаданные.Роли.СотрудникСклада);
				КонецЕсли;
				
				ПользовательСсылка.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.Имя = Объект.Логин;
		НовыйПользователь.Пароль = Объект.Пароль;
		НовыйПользователь.ПолноеИмя = Объект.Наименование;
		
		Если Объект.Роль = Перечисления.Роли.Администратор Тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администратор);
		Иначе
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.СотрудникСклада);
		КонецЕсли;
		
		НовыйПользователь.ПоказыватьВСпискеВыбора = Истина;
		НовыйПользователь.Записать();
		ТекущийОбъект.УникальныйИдентификатор = НовыйПользователь.УникальныйИдентификатор;
		
	КонецЕсли;
	
КонецПроцедуры
